zhengwang721/ASF/sam0/utils/cmsis/saml21/include/component/picop.h
#define PICOP_OCDCCNT_CCNT_Pos      0            /**< \brief (PICOP_OCDCCNT) Cycle Count */
#define PICOP_OCDCCNT_CCNT_Msk      (0xFFFFFFFFu << PICOP_OCDCCNT_CCNT_Pos)
#define PICOP_OCDCCNT_CCNT(value)   ((PICOP_OCDCCNT_CCNT_Msk & ((value) << PICOP_OCDCCNT_CCNT_Pos)))
#define PICOP_OCDCCNT_MASK          0xFFFFFFFFu  /**< \brief (PICOP_OCDCCNT) MASK Register */

/* -------- PICOP_OCDBPGEN : (PICOP Offset: 0x070) (R/W 32) OCD Breakpoint Generator n -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t BPGEN:16;         /*!< bit:  0..15  Breakpoint Generator               */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_OCDBPGEN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_OCDBPGEN_OFFSET       0x070        /**< \brief (PICOP_OCDBPGEN offset) OCD Breakpoint Generator n */
#define PICOP_OCDBPGEN_RESETVALUE   0x00000000   /**< \brief (PICOP_OCDBPGEN reset_value) OCD Breakpoint Generator n */

#define PICOP_OCDBPGEN_BPGEN_Pos    0            /**< \brief (PICOP_OCDBPGEN) Breakpoint Generator */
#define PICOP_OCDBPGEN_BPGEN_Msk    (0xFFFFu << PICOP_OCDBPGEN_BPGEN_Pos)
#define PICOP_OCDBPGEN_BPGEN(value) ((PICOP_OCDBPGEN_BPGEN_Msk & ((value) << PICOP_OCDBPGEN_BPGEN_Pos)))
#define PICOP_OCDBPGEN_MASK         0x0000FFFFu  /**< \brief (PICOP_OCDBPGEN) MASK Register */

/* -------- PICOP_R3R0 : (PICOP Offset: 0x080) (R/W 32) R3 to 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t R0:8;             /*!< bit:  0.. 7  Register 0                         */
    uint32_t R1:8;             /*!< bit:  8..15  Register 1                         */
    uint32_t R2:8;             /*!< bit: 16..23  Register 2                         */
    uint32_t R3:8;             /*!< bit: 24..31  Register 3                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_R3R0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_R3R0_OFFSET           0x080        /**< \brief (PICOP_R3R0 offset) R3 to 0 */

#define PICOP_R3R0_R0_Pos           0            /**< \brief (PICOP_R3R0) Register 0 */
#define PICOP_R3R0_R0_Msk           (0xFFu << PICOP_R3R0_R0_Pos)
#define PICOP_R3R0_R0(value)        ((PICOP_R3R0_R0_Msk & ((value) << PICOP_R3R0_R0_Pos)))
#define PICOP_R3R0_R1_Pos           8            /**< \brief (PICOP_R3R0) Register 1 */
#define PICOP_R3R0_R1_Msk           (0xFFu << PICOP_R3R0_R1_Pos)
#define PICOP_R3R0_R1(value)        ((PICOP_R3R0_R1_Msk & ((value) << PICOP_R3R0_R1_Pos)))
#define PICOP_R3R0_R2_Pos           16           /**< \brief (PICOP_R3R0) Register 2 */
#define PICOP_R3R0_R2_Msk           (0xFFu << PICOP_R3R0_R2_Pos)
#define PICOP_R3R0_R2(value)        ((PICOP_R3R0_R2_Msk & ((value) << PICOP_R3R0_R2_Pos)))
#define PICOP_R3R0_R3_Pos           24           /**< \brief (PICOP_R3R0) Register 3 */
#define PICOP_R3R0_R3_Msk           (0xFFu << PICOP_R3R0_R3_Pos)
#define PICOP_R3R0_R3(value)        ((PICOP_R3R0_R3_Msk & ((value) << PICOP_R3R0_R3_Pos)))
#define PICOP_R3R0_MASK             0xFFFFFFFFu  /**< \brief (PICOP_R3R0) MASK Register */

/* -------- PICOP_R7R4 : (PICOP Offset: 0x084) (R/W 32) R7 to 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t R0:8;             /*!< bit:  0.. 7  Register 0                         */
    uint32_t R1:8;             /*!< bit:  8..15  Register 1                         */
    uint32_t R2:8;             /*!< bit: 16..23  Register 2                         */
    uint32_t R3:8;             /*!< bit: 24..31  Register 3                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_R7R4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_R7R4_OFFSET           0x084        /**< \brief (PICOP_R7R4 offset) R7 to 4 */

#define PICOP_R7R4_R0_Pos           0            /**< \brief (PICOP_R7R4) Register 0 */
#define PICOP_R7R4_R0_Msk           (0xFFu << PICOP_R7R4_R0_Pos)
#define PICOP_R7R4_R0(value)        ((PICOP_R7R4_R0_Msk & ((value) << PICOP_R7R4_R0_Pos)))
#define PICOP_R7R4_R1_Pos           8            /**< \brief (PICOP_R7R4) Register 1 */
#define PICOP_R7R4_R1_Msk           (0xFFu << PICOP_R7R4_R1_Pos)
#define PICOP_R7R4_R1(value)        ((PICOP_R7R4_R1_Msk & ((value) << PICOP_R7R4_R1_Pos)))
#define PICOP_R7R4_R2_Pos           16           /**< \brief (PICOP_R7R4) Register 2 */
#define PICOP_R7R4_R2_Msk           (0xFFu << PICOP_R7R4_R2_Pos)
#define PICOP_R7R4_R2(value)        ((PICOP_R7R4_R2_Msk & ((value) << PICOP_R7R4_R2_Pos)))
#define PICOP_R7R4_R3_Pos           24           /**< \brief (PICOP_R7R4) Register 3 */
#define PICOP_R7R4_R3_Msk           (0xFFu << PICOP_R7R4_R3_Pos)
#define PICOP_R7R4_R3(value)        ((PICOP_R7R4_R3_Msk & ((value) << PICOP_R7R4_R3_Pos)))
#define PICOP_R7R4_MASK             0xFFFFFFFFu  /**< \brief (PICOP_R7R4) MASK Register */

/* -------- PICOP_R11R8 : (PICOP Offset: 0x088) (R/W 32) R11 to 8 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t R0:8;             /*!< bit:  0.. 7  Register 0                         */
    uint32_t R1:8;             /*!< bit:  8..15  Register 1                         */
    uint32_t R2:8;             /*!< bit: 16..23  Register 2                         */
    uint32_t R3:8;             /*!< bit: 24..31  Register 3                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_R11R8_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_R11R8_OFFSET          0x088        /**< \brief (PICOP_R11R8 offset) R11 to 8 */

#define PICOP_R11R8_R0_Pos          0            /**< \brief (PICOP_R11R8) Register 0 */
#define PICOP_R11R8_R0_Msk          (0xFFu << PICOP_R11R8_R0_Pos)
#define PICOP_R11R8_R0(value)       ((PICOP_R11R8_R0_Msk & ((value) << PICOP_R11R8_R0_Pos)))
#define PICOP_R11R8_R1_Pos          8            /**< \brief (PICOP_R11R8) Register 1 */
#define PICOP_R11R8_R1_Msk          (0xFFu << PICOP_R11R8_R1_Pos)
#define PICOP_R11R8_R1(value)       ((PICOP_R11R8_R1_Msk & ((value) << PICOP_R11R8_R1_Pos)))
#define PICOP_R11R8_R2_Pos          16           /**< \brief (PICOP_R11R8) Register 2 */
#define PICOP_R11R8_R2_Msk          (0xFFu << PICOP_R11R8_R2_Pos)
#define PICOP_R11R8_R2(value)       ((PICOP_R11R8_R2_Msk & ((value) << PICOP_R11R8_R2_Pos)))
#define PICOP_R11R8_R3_Pos          24           /**< \brief (PICOP_R11R8) Register 3 */
#define PICOP_R11R8_R3_Msk          (0xFFu << PICOP_R11R8_R3_Pos)
#define PICOP_R11R8_R3(value)       ((PICOP_R11R8_R3_Msk & ((value) << PICOP_R11R8_R3_Pos)))
#define PICOP_R11R8_MASK            0xFFFFFFFFu  /**< \brief (PICOP_R11R8) MASK Register */

/* -------- PICOP_R15R12 : (PICOP Offset: 0x08C) (R/W 32) R15 to 12 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t R0:8;             /*!< bit:  0.. 7  Register 0                         */
    uint32_t R1:8;             /*!< bit:  8..15  Register 1                         */
    uint32_t R2:8;             /*!< bit: 16..23  Register 2                         */
    uint32_t R3:8;             /*!< bit: 24..31  Register 3                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_R15R12_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_R15R12_OFFSET         0x08C        /**< \brief (PICOP_R15R12 offset) R15 to 12 */

#define PICOP_R15R12_R0_Pos         0            /**< \brief (PICOP_R15R12) Register 0 */
#define PICOP_R15R12_R0_Msk         (0xFFu << PICOP_R15R12_R0_Pos)
#define PICOP_R15R12_R0(value)      ((PICOP_R15R12_R0_Msk & ((value) << PICOP_R15R12_R0_Pos)))
#define PICOP_R15R12_R1_Pos         8            /**< \brief (PICOP_R15R12) Register 1 */
#define PICOP_R15R12_R1_Msk         (0xFFu << PICOP_R15R12_R1_Pos)
#define PICOP_R15R12_R1(value)      ((PICOP_R15R12_R1_Msk & ((value) << PICOP_R15R12_R1_Pos)))
#define PICOP_R15R12_R2_Pos         16           /**< \brief (PICOP_R15R12) Register 2 */
#define PICOP_R15R12_R2_Msk         (0xFFu << PICOP_R15R12_R2_Pos)
#define PICOP_R15R12_R2(value)      ((PICOP_R15R12_R2_Msk & ((value) << PICOP_R15R12_R2_Pos)))
#define PICOP_R15R12_R3_Pos         24           /**< \brief (PICOP_R15R12) Register 3 */
#define PICOP_R15R12_R3_Msk         (0xFFu << PICOP_R15R12_R3_Pos)
#define PICOP_R15R12_R3(value)      ((PICOP_R15R12_R3_Msk & ((value) << PICOP_R15R12_R3_Pos)))
#define PICOP_R15R12_MASK           0xFFFFFFFFu  /**< \brief (PICOP_R15R12) MASK Register */

/* -------- PICOP_R19R16 : (PICOP Offset: 0x090) (R/W 32) R19 to 16 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t R0:8;             /*!< bit:  0.. 7  Register 0                         */
    uint32_t R1:8;             /*!< bit:  8..15  Register 1                         */
    uint32_t R2:8;             /*!< bit: 16..23  Register 2                         */
    uint32_t R3:8;             /*!< bit: 24..31  Register 3                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_R19R16_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

