zhengwang721/ASF/sam0/utils/cmsis/saml21/include/component/picop.h
#define PICOP_R31R28_R0_Pos         0            /**< \brief (PICOP_R31R28) Register 0 */
#define PICOP_R31R28_R0_Msk         (0xFFu << PICOP_R31R28_R0_Pos)
#define PICOP_R31R28_R0(value)      ((PICOP_R31R28_R0_Msk & ((value) << PICOP_R31R28_R0_Pos)))
#define PICOP_R31R28_R1_Pos         8            /**< \brief (PICOP_R31R28) Register 1 */
#define PICOP_R31R28_R1_Msk         (0xFFu << PICOP_R31R28_R1_Pos)
#define PICOP_R31R28_R1(value)      ((PICOP_R31R28_R1_Msk & ((value) << PICOP_R31R28_R1_Pos)))
#define PICOP_R31R28_R2_Pos         16           /**< \brief (PICOP_R31R28) Register 2 */
#define PICOP_R31R28_R2_Msk         (0xFFu << PICOP_R31R28_R2_Pos)
#define PICOP_R31R28_R2(value)      ((PICOP_R31R28_R2_Msk & ((value) << PICOP_R31R28_R2_Pos)))
#define PICOP_R31R28_R3_Pos         24           /**< \brief (PICOP_R31R28) Register 3 */
#define PICOP_R31R28_R3_Msk         (0xFFu << PICOP_R31R28_R3_Pos)
#define PICOP_R31R28_R3(value)      ((PICOP_R31R28_R3_Msk & ((value) << PICOP_R31R28_R3_Pos)))
#define PICOP_R31R28_MASK           0xFFFFFFFFu  /**< \brief (PICOP_R31R28) MASK Register */

/* -------- PICOP_S1S0 : (PICOP Offset: 0x0A0) (R/W 32) System Regs 1 to 0: SR -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t R0:8;             /*!< bit:  0.. 7  Register 0                         */
    uint32_t R1:8;             /*!< bit:  8..15  Register 1                         */
    uint32_t R2:8;             /*!< bit: 16..23  Register 2                         */
    uint32_t R3:8;             /*!< bit: 24..31  Register 3                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_S1S0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_S1S0_OFFSET           0x0A0        /**< \brief (PICOP_S1S0 offset) System Regs 1 to 0: SR */

#define PICOP_S1S0_R0_Pos           0            /**< \brief (PICOP_S1S0) Register 0 */
#define PICOP_S1S0_R0_Msk           (0xFFu << PICOP_S1S0_R0_Pos)
#define PICOP_S1S0_R0(value)        ((PICOP_S1S0_R0_Msk & ((value) << PICOP_S1S0_R0_Pos)))
#define PICOP_S1S0_R1_Pos           8            /**< \brief (PICOP_S1S0) Register 1 */
#define PICOP_S1S0_R1_Msk           (0xFFu << PICOP_S1S0_R1_Pos)
#define PICOP_S1S0_R1(value)        ((PICOP_S1S0_R1_Msk & ((value) << PICOP_S1S0_R1_Pos)))
#define PICOP_S1S0_R2_Pos           16           /**< \brief (PICOP_S1S0) Register 2 */
#define PICOP_S1S0_R2_Msk           (0xFFu << PICOP_S1S0_R2_Pos)
#define PICOP_S1S0_R2(value)        ((PICOP_S1S0_R2_Msk & ((value) << PICOP_S1S0_R2_Pos)))
#define PICOP_S1S0_R3_Pos           24           /**< \brief (PICOP_S1S0) Register 3 */
#define PICOP_S1S0_R3_Msk           (0xFFu << PICOP_S1S0_R3_Pos)
#define PICOP_S1S0_R3(value)        ((PICOP_S1S0_R3_Msk & ((value) << PICOP_S1S0_R3_Pos)))
#define PICOP_S1S0_MASK             0xFFFFFFFFu  /**< \brief (PICOP_S1S0) MASK Register */

/* -------- PICOP_S3S2 : (PICOP Offset: 0x0A4) (R/W 32) System Regs 3 to 2: CTRL -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t R0:8;             /*!< bit:  0.. 7  Register 0                         */
    uint32_t R1:8;             /*!< bit:  8..15  Register 1                         */
    uint32_t R2:8;             /*!< bit: 16..23  Register 2                         */
    uint32_t R3:8;             /*!< bit: 24..31  Register 3                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_S3S2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_S3S2_OFFSET           0x0A4        /**< \brief (PICOP_S3S2 offset) System Regs 3 to 2: CTRL */

#define PICOP_S3S2_R0_Pos           0            /**< \brief (PICOP_S3S2) Register 0 */
#define PICOP_S3S2_R0_Msk           (0xFFu << PICOP_S3S2_R0_Pos)
#define PICOP_S3S2_R0(value)        ((PICOP_S3S2_R0_Msk & ((value) << PICOP_S3S2_R0_Pos)))
#define PICOP_S3S2_R1_Pos           8            /**< \brief (PICOP_S3S2) Register 1 */
#define PICOP_S3S2_R1_Msk           (0xFFu << PICOP_S3S2_R1_Pos)
#define PICOP_S3S2_R1(value)        ((PICOP_S3S2_R1_Msk & ((value) << PICOP_S3S2_R1_Pos)))
#define PICOP_S3S2_R2_Pos           16           /**< \brief (PICOP_S3S2) Register 2 */
#define PICOP_S3S2_R2_Msk           (0xFFu << PICOP_S3S2_R2_Pos)
#define PICOP_S3S2_R2(value)        ((PICOP_S3S2_R2_Msk & ((value) << PICOP_S3S2_R2_Pos)))
#define PICOP_S3S2_R3_Pos           24           /**< \brief (PICOP_S3S2) Register 3 */
#define PICOP_S3S2_R3_Msk           (0xFFu << PICOP_S3S2_R3_Pos)
#define PICOP_S3S2_R3(value)        ((PICOP_S3S2_R3_Msk & ((value) << PICOP_S3S2_R3_Pos)))
#define PICOP_S3S2_MASK             0xFFFFFFFFu  /**< \brief (PICOP_S3S2) MASK Register */

/* -------- PICOP_S5S4 : (PICOP Offset: 0x0A8) (R/W 32) System Regs 5 to 4: SREG, CCR -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t R0:8;             /*!< bit:  0.. 7  Register 0                         */
    uint32_t R1:8;             /*!< bit:  8..15  Register 1                         */
    uint32_t R2:8;             /*!< bit: 16..23  Register 2                         */
    uint32_t R3:8;             /*!< bit: 24..31  Register 3                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_S5S4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_S5S4_OFFSET           0x0A8        /**< \brief (PICOP_S5S4 offset) System Regs 5 to 4: SREG, CCR */

#define PICOP_S5S4_R0_Pos           0            /**< \brief (PICOP_S5S4) Register 0 */
#define PICOP_S5S4_R0_Msk           (0xFFu << PICOP_S5S4_R0_Pos)
#define PICOP_S5S4_R0(value)        ((PICOP_S5S4_R0_Msk & ((value) << PICOP_S5S4_R0_Pos)))
#define PICOP_S5S4_R1_Pos           8            /**< \brief (PICOP_S5S4) Register 1 */
#define PICOP_S5S4_R1_Msk           (0xFFu << PICOP_S5S4_R1_Pos)
#define PICOP_S5S4_R1(value)        ((PICOP_S5S4_R1_Msk & ((value) << PICOP_S5S4_R1_Pos)))
#define PICOP_S5S4_R2_Pos           16           /**< \brief (PICOP_S5S4) Register 2 */
#define PICOP_S5S4_R2_Msk           (0xFFu << PICOP_S5S4_R2_Pos)
#define PICOP_S5S4_R2(value)        ((PICOP_S5S4_R2_Msk & ((value) << PICOP_S5S4_R2_Pos)))
#define PICOP_S5S4_R3_Pos           24           /**< \brief (PICOP_S5S4) Register 3 */
#define PICOP_S5S4_R3_Msk           (0xFFu << PICOP_S5S4_R3_Pos)
#define PICOP_S5S4_R3(value)        ((PICOP_S5S4_R3_Msk & ((value) << PICOP_S5S4_R3_Pos)))
#define PICOP_S5S4_MASK             0xFFFFFFFFu  /**< \brief (PICOP_S5S4) MASK Register */

/* -------- PICOP_S11S10 : (PICOP Offset: 0x0B4) (R/W 32) System Regs 11 to 10: Immediate -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t R0:8;             /*!< bit:  0.. 7  Register 0                         */
    uint32_t R1:8;             /*!< bit:  8..15  Register 1                         */
    uint32_t R2:8;             /*!< bit: 16..23  Register 2                         */
    uint32_t R3:8;             /*!< bit: 24..31  Register 3                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} PICOP_S11S10_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PICOP_S11S10_OFFSET         0x0B4        /**< \brief (PICOP_S11S10 offset) System Regs 11 to 10: Immediate */

